GopalSaraf/Practicals/PSDL/include/proc/pic16lf18445.inc
// Register: ADSTPTL
#define ADSTPTL ADSTPTL
ADSTPTL                                  equ 0092h
// bitfield definitions
ADSTPTL_STPT_POSN                        equ 0000h
ADSTPTL_STPT_POSITION                    equ 0000h
ADSTPTL_STPT_SIZE                        equ 0008h
ADSTPTL_STPT_LENGTH                      equ 0008h
ADSTPTL_STPT_MASK                        equ 00FFh
ADSTPTL_ADSTPT0_POSN                     equ 0000h
ADSTPTL_ADSTPT0_POSITION                 equ 0000h
ADSTPTL_ADSTPT0_SIZE                     equ 0001h
ADSTPTL_ADSTPT0_LENGTH                   equ 0001h
ADSTPTL_ADSTPT0_MASK                     equ 0001h
ADSTPTL_ADSTPT1_POSN                     equ 0001h
ADSTPTL_ADSTPT1_POSITION                 equ 0001h
ADSTPTL_ADSTPT1_SIZE                     equ 0001h
ADSTPTL_ADSTPT1_LENGTH                   equ 0001h
ADSTPTL_ADSTPT1_MASK                     equ 0002h
ADSTPTL_ADSTPT2_POSN                     equ 0002h
ADSTPTL_ADSTPT2_POSITION                 equ 0002h
ADSTPTL_ADSTPT2_SIZE                     equ 0001h
ADSTPTL_ADSTPT2_LENGTH                   equ 0001h
ADSTPTL_ADSTPT2_MASK                     equ 0004h
ADSTPTL_ADSTPT3_POSN                     equ 0003h
ADSTPTL_ADSTPT3_POSITION                 equ 0003h
ADSTPTL_ADSTPT3_SIZE                     equ 0001h
ADSTPTL_ADSTPT3_LENGTH                   equ 0001h
ADSTPTL_ADSTPT3_MASK                     equ 0008h
ADSTPTL_ADSTPT4_POSN                     equ 0004h
ADSTPTL_ADSTPT4_POSITION                 equ 0004h
ADSTPTL_ADSTPT4_SIZE                     equ 0001h
ADSTPTL_ADSTPT4_LENGTH                   equ 0001h
ADSTPTL_ADSTPT4_MASK                     equ 0010h
ADSTPTL_ADSTPT5_POSN                     equ 0005h
ADSTPTL_ADSTPT5_POSITION                 equ 0005h
ADSTPTL_ADSTPT5_SIZE                     equ 0001h
ADSTPTL_ADSTPT5_LENGTH                   equ 0001h
ADSTPTL_ADSTPT5_MASK                     equ 0020h
ADSTPTL_ADSTPT6_POSN                     equ 0006h
ADSTPTL_ADSTPT6_POSITION                 equ 0006h
ADSTPTL_ADSTPT6_SIZE                     equ 0001h
ADSTPTL_ADSTPT6_LENGTH                   equ 0001h
ADSTPTL_ADSTPT6_MASK                     equ 0040h
ADSTPTL_ADSTPT7_POSN                     equ 0007h
ADSTPTL_ADSTPT7_POSITION                 equ 0007h
ADSTPTL_ADSTPT7_SIZE                     equ 0001h
ADSTPTL_ADSTPT7_LENGTH                   equ 0001h
ADSTPTL_ADSTPT7_MASK                     equ 0080h
ADSTPTL_ADSTPT_POSN                      equ 0000h
ADSTPTL_ADSTPT_POSITION                  equ 0000h
ADSTPTL_ADSTPT_SIZE                      equ 0008h
ADSTPTL_ADSTPT_LENGTH                    equ 0008h
ADSTPTL_ADSTPT_MASK                      equ 00FFh
ADSTPTL_STPT0_POSN                       equ 0000h
ADSTPTL_STPT0_POSITION                   equ 0000h
ADSTPTL_STPT0_SIZE                       equ 0001h
ADSTPTL_STPT0_LENGTH                     equ 0001h
ADSTPTL_STPT0_MASK                       equ 0001h
ADSTPTL_STPT1_POSN                       equ 0001h
ADSTPTL_STPT1_POSITION                   equ 0001h
ADSTPTL_STPT1_SIZE                       equ 0001h
ADSTPTL_STPT1_LENGTH                     equ 0001h
ADSTPTL_STPT1_MASK                       equ 0002h
ADSTPTL_STPT2_POSN                       equ 0002h
ADSTPTL_STPT2_POSITION                   equ 0002h
ADSTPTL_STPT2_SIZE                       equ 0001h
ADSTPTL_STPT2_LENGTH                     equ 0001h
ADSTPTL_STPT2_MASK                       equ 0004h
ADSTPTL_STPT3_POSN                       equ 0003h
ADSTPTL_STPT3_POSITION                   equ 0003h
ADSTPTL_STPT3_SIZE                       equ 0001h
ADSTPTL_STPT3_LENGTH                     equ 0001h
ADSTPTL_STPT3_MASK                       equ 0008h
ADSTPTL_STPT4_POSN                       equ 0004h
ADSTPTL_STPT4_POSITION                   equ 0004h
ADSTPTL_STPT4_SIZE                       equ 0001h
ADSTPTL_STPT4_LENGTH                     equ 0001h
ADSTPTL_STPT4_MASK                       equ 0010h
ADSTPTL_STPT5_POSN                       equ 0005h
ADSTPTL_STPT5_POSITION                   equ 0005h
ADSTPTL_STPT5_SIZE                       equ 0001h
ADSTPTL_STPT5_LENGTH                     equ 0001h
ADSTPTL_STPT5_MASK                       equ 0020h
ADSTPTL_STPT6_POSN                       equ 0006h
ADSTPTL_STPT6_POSITION                   equ 0006h
ADSTPTL_STPT6_SIZE                       equ 0001h
ADSTPTL_STPT6_LENGTH                     equ 0001h
ADSTPTL_STPT6_MASK                       equ 0040h
ADSTPTL_STPT7_POSN                       equ 0007h
ADSTPTL_STPT7_POSITION                   equ 0007h
ADSTPTL_STPT7_SIZE                       equ 0001h
ADSTPTL_STPT7_LENGTH                     equ 0001h
ADSTPTL_STPT7_MASK                       equ 0080h

// Register: ADSTPTH
#define ADSTPTH ADSTPTH
ADSTPTH                                  equ 0093h
// bitfield definitions
ADSTPTH_STPT_POSN                        equ 0000h
ADSTPTH_STPT_POSITION                    equ 0000h
ADSTPTH_STPT_SIZE                        equ 0008h
ADSTPTH_STPT_LENGTH                      equ 0008h
ADSTPTH_STPT_MASK                        equ 00FFh
ADSTPTH_ADSTPT8_POSN                     equ 0000h
ADSTPTH_ADSTPT8_POSITION                 equ 0000h
ADSTPTH_ADSTPT8_SIZE                     equ 0001h
ADSTPTH_ADSTPT8_LENGTH                   equ 0001h
ADSTPTH_ADSTPT8_MASK                     equ 0001h
ADSTPTH_ADSTPT9_POSN                     equ 0001h
ADSTPTH_ADSTPT9_POSITION                 equ 0001h
ADSTPTH_ADSTPT9_SIZE                     equ 0001h
ADSTPTH_ADSTPT9_LENGTH                   equ 0001h
ADSTPTH_ADSTPT9_MASK                     equ 0002h
ADSTPTH_ADSTPT10_POSN                    equ 0002h
ADSTPTH_ADSTPT10_POSITION                equ 0002h
ADSTPTH_ADSTPT10_SIZE                    equ 0001h
ADSTPTH_ADSTPT10_LENGTH                  equ 0001h
ADSTPTH_ADSTPT10_MASK                    equ 0004h
ADSTPTH_ADSTPT11_POSN                    equ 0003h
ADSTPTH_ADSTPT11_POSITION                equ 0003h
ADSTPTH_ADSTPT11_SIZE                    equ 0001h
ADSTPTH_ADSTPT11_LENGTH                  equ 0001h
ADSTPTH_ADSTPT11_MASK                    equ 0008h
ADSTPTH_ADSTPT12_POSN                    equ 0004h
ADSTPTH_ADSTPT12_POSITION                equ 0004h
ADSTPTH_ADSTPT12_SIZE                    equ 0001h
ADSTPTH_ADSTPT12_LENGTH                  equ 0001h
ADSTPTH_ADSTPT12_MASK                    equ 0010h
ADSTPTH_ADSTPT13_POSN                    equ 0005h
ADSTPTH_ADSTPT13_POSITION                equ 0005h
ADSTPTH_ADSTPT13_SIZE                    equ 0001h
ADSTPTH_ADSTPT13_LENGTH                  equ 0001h
ADSTPTH_ADSTPT13_MASK                    equ 0020h
ADSTPTH_ADSTPT14_POSN                    equ 0006h
ADSTPTH_ADSTPT14_POSITION                equ 0006h
ADSTPTH_ADSTPT14_SIZE                    equ 0001h
ADSTPTH_ADSTPT14_LENGTH                  equ 0001h
ADSTPTH_ADSTPT14_MASK                    equ 0040h
ADSTPTH_ADSTPT15_POSN                    equ 0007h
ADSTPTH_ADSTPT15_POSITION                equ 0007h
ADSTPTH_ADSTPT15_SIZE                    equ 0001h
ADSTPTH_ADSTPT15_LENGTH                  equ 0001h
ADSTPTH_ADSTPT15_MASK                    equ 0080h
ADSTPTH_ADSTPT_POSN                      equ 0000h
ADSTPTH_ADSTPT_POSITION                  equ 0000h
ADSTPTH_ADSTPT_SIZE                      equ 0008h
ADSTPTH_ADSTPT_LENGTH                    equ 0008h
ADSTPTH_ADSTPT_MASK                      equ 00FFh
ADSTPTH_STPT8_POSN                       equ 0000h
ADSTPTH_STPT8_POSITION                   equ 0000h
ADSTPTH_STPT8_SIZE                       equ 0001h
ADSTPTH_STPT8_LENGTH                     equ 0001h
ADSTPTH_STPT8_MASK                       equ 0001h
ADSTPTH_STPT9_POSN                       equ 0001h
ADSTPTH_STPT9_POSITION                   equ 0001h
ADSTPTH_STPT9_SIZE                       equ 0001h
ADSTPTH_STPT9_LENGTH                     equ 0001h
ADSTPTH_STPT9_MASK                       equ 0002h
ADSTPTH_STPT10_POSN                      equ 0002h
ADSTPTH_STPT10_POSITION                  equ 0002h
ADSTPTH_STPT10_SIZE                      equ 0001h
ADSTPTH_STPT10_LENGTH                    equ 0001h
ADSTPTH_STPT10_MASK                      equ 0004h
ADSTPTH_STPT11_POSN                      equ 0003h
ADSTPTH_STPT11_POSITION                  equ 0003h
ADSTPTH_STPT11_SIZE                      equ 0001h
ADSTPTH_STPT11_LENGTH                    equ 0001h
ADSTPTH_STPT11_MASK                      equ 0008h
ADSTPTH_STPT12_POSN                      equ 0004h
ADSTPTH_STPT12_POSITION                  equ 0004h
ADSTPTH_STPT12_SIZE                      equ 0001h
ADSTPTH_STPT12_LENGTH                    equ 0001h
ADSTPTH_STPT12_MASK                      equ 0010h
ADSTPTH_STPT13_POSN                      equ 0005h
ADSTPTH_STPT13_POSITION                  equ 0005h
ADSTPTH_STPT13_SIZE                      equ 0001h
ADSTPTH_STPT13_LENGTH                    equ 0001h
ADSTPTH_STPT13_MASK                      equ 0020h
ADSTPTH_STPT15_POSN                      equ 0006h
ADSTPTH_STPT15_POSITION                  equ 0006h
ADSTPTH_STPT15_SIZE                      equ 0001h
ADSTPTH_STPT15_LENGTH                    equ 0001h
ADSTPTH_STPT15_MASK                      equ 0040h
ADSTPTH_STPT16_POSN                      equ 0007h
ADSTPTH_STPT16_POSITION                  equ 0007h
ADSTPTH_STPT16_SIZE                      equ 0001h
ADSTPTH_STPT16_LENGTH                    equ 0001h
ADSTPTH_STPT16_MASK                      equ 0080h

